---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteRoomsInNonPlanViews
source: html/20aaa988-6c9e-b1d2-88bb-7e23b2c1dd1e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteRoomsInNonPlanViews Property

[Rooms] can only be pasted in Plan or Ceiling Plan views.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotPasteRoomsInNonPlanViews { get; }
```